var mockData = [{
	"name": "图书",
	"pId": "",
	"id": "0"
}, {
	"name": "测试js正则元字符:[]\\^$.|?*+()",
	"pId": "0",
	"id": "06"
},{
	"name": "测试其他字符:{}<>'\"~`!@#%&-;:/,",
	"pId": "0",
	"id": "07"
},{
	"name": "文学",
	"pId": "0",
	"id": "00"
}, {
	"name": "历史",
	"pId": "0",
	"id": "01"
}, {
	"name": "法律",
	"pId": "0",
	"id": "02"
}, {
	"name": "辞典与工具书",
	"pId": "0",
	"id": "03"
}, {
	"name": "科学与自然",
	"pId": "0",
	"id": "04"
},{
	"name": "自然科学总论",
	"pId": "04",
	"id": "040"
},{
	"name": "数学",
	"pId": "04",
	"id": "041"
},{
	"name": "物理",
	"pId": "04",
	"id": "042"
},{
	"name": "天文学 地球科学",
	"pId": "04",
	"id": "043"
}, {
	"name": "计算机与互联网",
	"pId": "0",
	"id": "05"
}, {
	"name": "编程与开发",
	"pId": "05",
	"id": "050"
}, {
	"name": "编程语言与工具",
	"pId": "050",
	"id": "0500"
}, {
	"name": "C & C++",
	"pId": "0500",
	"id": "05000"
},{
	"name": "JAVA",
	"pId": "0500",
	"id": "05001"
},{
	"name": "Python",
	"pId": "0500",
	"id": "05002"
},{
	"name": "Python编程 从入门到实践",
	"pId": "05002",
	"id": "050020"
},{
	"name": "Python编程快速上手 让繁琐工作自动化",
	"pId": "05002",
	"id": "050021"
}, {
	"name": "算法与数据结构",
	"pId": "050",
	"id": "0501"
}, {
	"name": "编译原理和编译器",
	"pId": "050",
	"id": "0502"
}, {
	"name": "操作系统",
	"pId": "05",
	"id": "051"
}, {
	"name": "数据库",
	"pId": "05",
	"id": "052"
}, {
	"name": "计算机科学理论",
	"pId": "05",
	"id": "053"
}, {
	"name": "云计算与大数据",
	"pId": "05",
	"id": "054"
}]